

const data = [
    {
      Name: " MOHAMMED SHAFEEQ FAIZY",
      designation: "PRESIDENT",
     Image:"Images/208556536_3327651817461489_2779505358644199302_n.jpg"
    },
    {
      Name: "JUNAIS V",
      designation: "VICE PRESIDENT",
      Image: "https://scontent.fcok4-1.fna.fbcdn.net/v/t1.6435-9/106016196_2769542146484289_7718231355746559673_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=09cbfe&_nc_ohc=2bxmeqFVVD0AX8w1d0v&_nc_ht=scontent.fcok4-1.fna&oh=00_AfBp0SUSXvWl47Af_MSyIvV4hghLNayAptRGvHtyMf4pWQ&oe=6546AA02"
    
    },
    {
        Name: "MOHAMMED DILSHAD V",
      designation: "GEN. SECRETARY",
     
    },
    {
        Name: "SIRAJUDHEEN KC",
      designation: "WOR. SECRETARY",
     
    },
    {
        Name: "FARIS P",
      designation: "TREASURER",
   
    },
    {
        Name: "NADEEL RAHMAN V",
        designation: "IBAD WING SECRETARY",
     
      },
      {
        Name: "SIRAJUDHEEN M",
        designation: "VIQAYA WING SECRETARY",
        Image:"https://scontent.fcok4-1.fna.fbcdn.net/v/t1.6435-9/66364789_106090107366701_8094222081014628352_n.jpg?_nc_cat=111&ccb=1-7&_nc_sid=7a1959&_nc_ohc=WvD9-MpSeD8AX80f7lW&_nc_ht=scontent.fcok4-1.fna&oh=00_AfB4HrDaeaRdpcD3A7YIV5fodjqQvXWW-viM1XgLwdMtrg&oe=65469AA1"
     
      },
      {
        Name: "MUNEER M",
        designation: "TREND WING SECRETARY",
        Image:"https://scontent.fcok4-1.fna.fbcdn.net/v/t1.6435-9/153820442_185875956667699_2883774029196193252_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=7a1959&_nc_ohc=mf4JALCmMwAAX8vWn9J&_nc_ht=scontent.fcok4-1.fna&oh=00_AfBzuGF7mdZXymBQt6-tnD87sPDNsqpxhyZ5vwmbCp85Hg&oe=6546C959"
     
      },
      {
        Name: "ADIL MK",
        designation: "TWALABA WING SECRETARY",
        Image:"https://scontent.fcok4-1.fna.fbcdn.net/v/t39.30808-6/272876164_918772218998982_2853850508345829627_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=1b51e3&_nc_ohc=Ih7j3jAenkAAX_IJPVa&_nc_ht=scontent.fcok4-1.fna&oh=00_AfDX_P0r2DVrxoXAC6tNXPVgFRRA4VW5HwxyYvnXVpm8rA&oe=6523B756"
     
      },
      {
        Name: "SUHAIL V",
        designation: "SARGALAYA WING SECRETARY",
     
      },
      {
        Name: "SHIBILI V",
        designation: "SAHACHARI WING SECRETARY",
     
      },
      {
        Name: "NASEEF",
        designation: "MEDIA WING SECRETARY",
     
      },
      {
        Name: "ABOOBACKER SIDHEEQ",
        designation: "EXECUTIVE MEMBER",
     
      },
      {
        Name: "ANWAR M",
        designation: "EXECUTIVE MEMBER",
        Image:"https://scontent.fcok4-1.fna.fbcdn.net/v/t1.6435-9/76169701_2158563290953868_9150610841274417152_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=09cbfe&_nc_ohc=qU4mNE0T-aoAX8Pgwzx&_nc_ht=scontent.fcok4-1.fna&oh=00_AfBCodaNZa_7n18MmrMpvEp8VDYYn0Oa76qqfc9pjcim7Q&oe=6546A023"
     
      },
      {
        Name: "ANSHAD K.P",
        designation: "EXECUTIVE MEMBER",
     
      },
      {
        Name: "NIYAS T",
        designation: "EXECUTIVE MEMBER",
     
      },
      {
        Name: "DILSHAN OK",
        designation: "EXECUTIVE MEMBER",
     
      },
      
  ];
const about = () => {
  return (

    <div className='flex flex-col justify-center text-justify items-center'>
<h1 className='text-3xl md:text-2xl sm:text-xl sm:font-bol text-sky-700 font-extrabold'>SKSSF- സമസ്ത കേരള സുന്നി സ്റ്റുഡൻസ് ഫേഡറേഷൻ</h1>
<div className="w-[80%]  mt-4">
<p className="text-sky-900 font-medium text-md">എണ്‍പതുകള്‍ക്ക് ശേഷം സമസ്തയില്‍ ഉണ്ടായ നിര്‍ഭാഗ്യകരമായ പ്രശ്‌നങ്ങളില്‍ ഗുരുവര്യന്മാരെ അധിക്ഷേപിക്കാനും നാടിന്റെ നാനാഭാഗത്തും പ്രശ്‌നങ്ങളുടെ വിത്ത്പാകാനും ഒരു വിദ്യാര്‍ത്ഥി സംഘടന ശ്രമിച്ചപ്പോള്‍ അതിനെതിരായി നന്മയുടെ നാവും കര്‍മചേതനയുടെ കരവുമുയര്‍ത്തി സ്ഥാപിതമായ വിദ്യാര്‍ത്ഥി പ്രസ്ഥാനമാണ് എസ്.കെ.എസ്.എസ്.എഫ്. സമസ്ത കേരള ജംഇയ്യത്തുല്‍ ഉലമയുടെ അഭിവന്ദ്യ ഗുരുവര്യരുടെ ആശിര്‍വാദവും അനുഗ്രഹവും നേടി 1989 ഫെബ്രുവരി 19ന് കോഴിക്കോട് സാമൂതിരി ഹൈസ്‌കൂള്‍ (കോട്ടുമല ഉസ്താദ് നഗര്‍) എസ്.കെ.എസ്.എസ്.എഫ് എന്ന ധാര്‍മ്മിക വിദ്യാര്‍ത്ഥി പ്രസ്ഥാനത്തിന്റെ പിറവിക്ക് കാരണമായി. ആയിരക്കണക്കിന് വിദ്യര്‍ത്ഥികളില്‍ നിന്നുയര്‍ന്ന തക്ബീര്‍ ധ്വനികള്‍ക്കിടയില്‍ സമസ്ത പരീക്ഷാബോര്‍ഡ് ചെയര്‍മാന്‍ സി.എച്ച്. ഹൈദ്രോസ് മുസ്‌ലിയാര്‍ സംഘടനയുടെ പേരു പ്രഖ്യാപിച്ചു. കെ.വി. മുഹമ്മദ് മുസ്‌ലിയാര്‍ കൂറ്റനാട് ഉദ്ഘാടനവും അഭിവന്ദ്യനായ കെ.കെ. അബൂബക്കര്‍ ഹസ്രത്തിന്റെ അധ്യക്ഷതയിലാണ് ഈ സമ്മേളനം മഹത്തായ വിദ്യാര്‍ത്ഥി പ്രസ്ഥാനത്തിന് പിറവി കൊടുത്തത്. നാട്ടിക വി.മൂസ മുസ്‌ലിയാര്‍, കെ.ടി മാനു മുസ്‌ലിയാര്‍, അബ്ദുസമദ് സമദാനി, സെയ്തു മുഹമ്മദ് നിസാമി, എന്നീ പണ്ഡിതരുടെ സാന്നിധ്യത്തില്‍ കേരളത്തിലെ വിദ്യാര്‍ത്ഥി പ്രസ്ഥാനങ്ങളുടെ ചരിത്രത്തിന് ഒരു മനോഹരമായ അധ്യായം അന്ന് രചിക്കപ്പെട്ടു.</p>
</div>

<div className="mt-10 w-full flex flex-col">
        <h1 className="text-3xl font-bold text-center text-green-600">SKSSF CHAPPANANGADI UNIT COMMITTEE</h1>

        <div className="w-[70%]  mx-auto overflow-x-auto shadow-md sm:rounded-lg mt-10">
          <table className="w-full text-sm text-left text-gray-500 dark:text-gray-400">
        <thead className="text-xs  text-gray-700 uppercase bg-gray-50 dark:bg-gray-700 dark:text-gray-400">
          <tr>
            <th scope="col" className="px-6 text-2xl py-3">
               Name
            </th>
            <th scope="col" className="px-6 text-2xl py-3">
              Designation
            </th>
            <th scope="col" className="px-6 text-2xl py-3">
              Image
            </th>
            
          </tr>
        </thead>
        <tbody>
          {data.map((item, index) => (
            <tr
              key={index}
              className={`${
                index % 2 === 0 ? "bg-white" : "bg-gray-50"
              } shadow-2xl border-b`}
            >
              <td className="px-6 py-4 font-medium text-gray-900 text-xl whitespace-nowrap">
                {item.Name}
              </td>
              <td className="px-6 py-4 text-xl">{item.designation}</td>
              <td className="px-6 py-4"><img className="h-35 w-40" src={item.Image} alt="" /></td>
            
            </tr>
          ))}
        </tbody>
      </table>
    </div>
    <div className="mt-12 sm:mt-16 md:mt-20 lg:mt-28 flex justify-center flex-col items-center">

    <h1 className="text-3xl md:text-2xl sm:text-xl text-md text-center text-sky-700 font-extrabold">
        HISTORY
      </h1>

      <div className="w-[80%]  mt-4">
<p className="text-sky-900 font-medium text-justify leading-relaxed  text-md"> മഹാസംഗമമായപ്പോള്‍ കുറ്റിപ്പുറത്ത് നിളാതിരം ശാസ്ത്രീയമായ സംഘാടക മികവു ചിന്തോദ്ദീപങ്ങളായ ചര്‍ച്ചകളും കണ്ട് പുളകമണിഞ്ഞു. അന്ന് ഓടിയെത്തിയ ജനലക്ഷങ്ങള്‍ നിളയുടെ തീരത്തെ മറ്റേതു ചരിത്രത്തെക്കാളും വലിയ മഹാ സംഗമമായി. രണ്ടാം ദശകത്തിലെ മജ്‌ലിസ് ഇന്‍തിസാബ് നാമധേയം പോലെ വ്യത്യസ്തകള്‍ നിറഞ്ഞ സമ്മേളനമായി. നവോത്ഥാനത്തിന്റെ പുതുജാലകങ്ങള്‍ തുറക്കാന്‍ അനിവാര്യമായ ചുവടുകളാണ് ഈ വിദ്യാര്‍ത്ഥി സംഘശക്തിക്ക് ഈ സമ്മേളനങ്ങള്‍ നല്‍കിയ കരുത്ത്.
വാദീനൂര്‍ സമ്മേളനത്തിന്റെ ഉപോല്‍പന്നമായി വന്ന പ്രബോധന വിംഗാണ് ഇബാദ്. ഇസ്‌ലാമിക പ്രബോധന രംഗത്ത് ഇബാദ് വിജയക്കൊടി നാട്ടിക്കഴിഞ്ഞു. സമുദായത്തിനകത്ത് ജീര്‍ണ്ണതകള്‍ ഉന്മൂലനം ചെയ്യാനുള്ള ശ്രമങ്ങളില്‍ വ്യാപൃതമാകാവുന്നതോടൊപ്പം വ്യവസ്ഥാപിതവും മനഃശാസ്ത്രപരവുമായ സമീപനത്തിലൂടെ ഇതരമതാനുയായികളില്‍ ഇസ്‌ലാമിനെ പരിചയപ്പെടുത്താന്‍ ഇബാദിന് കഴിഞ്ഞു. അനേകം ഹൃദയങ്ങള്‍ക്ക് വെളിച്ചം നല്‍കാന്‍ കഴിഞ്ഞു എന്നതോടൊപ്പം നിരന്തരം ഇരുട്ട് മാറിയ മനസ്സുകളുടെ എണ്ണം ശതഗുണീഭവിക്കുകയാണ്. അറവങ്കരയില്‍ ആരംഭം കുറിച്ച പ്രവാചക വൈദ്യചികിത്സാകേന്ദ്രം പാസ്സ് ലഹരിക്ക് അടിമപ്പെട്ടവരെ ലഹരിമുക്തമാക്കാനുള്ള കേന്ദ്രവും കൂടിയാണ്. മഹല്ല് തലങ്ങളില്‍ പ്രവര്‍ത്തനനിരതമാവാനും സത്യസരണിയെക്കുറിച്ച് പഠിപ്പിക്കാനുമായി സമഗ്രമഹല്ല് പദ്ധതി ഇബാദ് രൂപീകരിച്ചിട്ടുണ്ട്. സംസ്ഥാനത്ത് ഒട്ടാകെ നിരന്തരം പ്രവര്‍ത്തിക്കുന്നവിധം നാനൂറ് ദാഇമാര്‍ ഇന്ന് ഇബാദിന്റെ പ്രവര്‍ത്തനത്തിന് സജ്ജമാണ്.
വിദ്യാഭ്യാസ പ്രവര്‍ത്തന രംഗത്ത് ശക്തമായ മുന്നേറ്റമാണ് സംഘടനയുടെ ഉപ വിഭാഗമായ ട്രെന്റ് നടത്തുന്നത്. ഹയര്‍ എഡ്യുക്കേഷന്‍ പ്രോഗ്രാമിന്റെ ഭാഗമായി മസ്‌ക്കറ്റ് സുന്നി സെന്ററിന്റെ സാമ്പത്തിക സഹായത്തോടെ നടത്തിയ പദ്ധതി വഴി രണ്ട് ഐ.എ.എസുകാരെ സമൂഹത്തിന് നല്‍കി ട്രന്റിന്റെ പ്രവര്‍ത്തന രംഗത്ത് വ്യാപൃതനായിരുന്ന മുഹമ്മദലി ശിഹാബിന്റെ ഐ.എ.എസ്. ചട്ടവും സംഘടനയുടെ പ്രവര്‍ത്തന രംഗത്തെ ധന്യതയാണ്. ഷാര്‍ജ എസ്.കെ.എസ്.എസ്.എഫ് കമ്മിറ്റിയുടെ ആത്മാര്‍ത്ഥമായ സഹകരണത്തോടെ ഡിസംബര്‍ 31ന് ഉദ്ഘാടനം ചെയ്ത സ്റ്റെപ് പദ്ധതി നൂറ്റിമുപ്പത്തിയാറ് വിദ്യാര്‍ത്ഥികളെ തെരെഞ്ഞെടുത്ത് അവര്‍ക്ക് ഉന്നത പഠനത്തിന് വിശിഷ്യാ സിവില്‍ സര്‍വ്വീസ് മേഖലയിലേക്കുള്ള പ്രചോദന പരിശീലനങ്ങള്‍ നല്‍കാവുന്ന വിപുല പദ്ധതിയാണ് ആവിഷ്‌കരിച്ചിട്ടുള്ളത്. കേരള വിദ്യാഭ്യാസ വകുപ്പ് മന്ത്രി അബ്ദുള്‍ റബ്ബ് സാഹിബ് ഉദ്ഘാടനം ചെയ്ത പരിപാടി വലിയ പ്രതീക്ഷയാണ് ഉണര്‍ത്തുന്നത്. മോട്ടിവേഷന്‍ ക്ലാസുകള്‍ കരിയര്‍, ഗൈഡന്‍സ് എന്നിങ്ങനെ, ട്രെന്റ് വിദ്യാഭ്യാസ പ്രവര്‍ത്തന രംഗത്ത് നവോത്ഥാന വിപ്ലവം സൃഷ്ടിക്കുകയാണ്.
ഇസ്‌ലാമിക സാഹിത്യ രംഗത്ത് പ്രസാധന വിഭാഗമായ ഇസ പുസ്തകങ്ങള്‍, പ്രഭാഷണ സിഡികള്‍ എന്നിവ കാലിക പ്രസക്തമായ വിധം പ്രസിദ്ധീകരിക്കുന്നു. കേരളത്തിലങ്ങോളം ശാഖകളും പതിനായിരക്കണക്കിന് പഠിതാക്കളുമുള്ള ഖുര്‍ആന്‍ സ്റ്റഡി സെന്റര്‍, സമസ്തയുടെ ആശയ പ്രചരണത്തിന് എസ്.കെ.എസ്,എസ്.എഫിന്റെ താങ്ങായി പ്രവര്‍ത്തിക്കുന്ന പ്രവാസി വിംഗുകള്‍ ഇസ്‌ലാമിക് സെന്ററുകള്‍, സുന്നി സെന്ററുകള്‍, സംഘടന പ്രവര്‍ത്തനത്തിന്റെ ജീവനാഡികള്‍ യഥാര്‍ത്ഥത്തില്‍ പ്രവാസ സമിതികളാണ്. അവരുടെ നിശ്ശബ്ദ സേവനങ്ങളെ എത്ര പ്രശംസിച്ചാലും മതിയാവില്ല. ഓരോ ഘട്ടത്തിലും സംഘടന ഏറ്റെടുക്കുന്ന വിവിധ പ്രവര്‍ത്തനങ്ങള്‍ നിര്‍ലോഭം സഹകരിച്ച് വിജയിപ്പിക്കുന്നതില്‍ അവരുടെ പങ്ക് വലുതാണ്.
സമാകാലിക പ്രശ്‌നങ്ങളെ അപഗ്രഥിച്ച് സുന്നത്ത് ജമാഅത്തിന്റെ ആശയങ്ങള്‍ക്കനുസരിച്ച് നേരിന്റെ ശബ്ദം ഉറച്ച് പറയുന്ന സത്യധാരയും പ്രചരണ രംഗത്തെ നൂതമ സംവിധാനമായി വിവരസാങ്കേതിക വിദ്യയുടെ സഹായമായി മാറിയ കേരള ഇസ്‌ലാമിക് ക്ലാസ് റൂമും സംഘടനയുടെ ആശയ പ്രചരണസംവിധാനങ്ങളുടെ പുഷ്‌കല ഉപാധികളാണ്.
കാമ്പസ് ജീവിതത്തിന്റെ ധാര്‍മ്മികതയെ ശരിപ്പെടുത്താന്‍ വിപുല സംവിധാനങ്ങളോടെ പ്രവര്‍ത്തിക്കുന്ന കാമ്പസ് വിംഗ്, വിവിധ പ്രവര്‍ത്തന മേഖലകള്‍ വ്യാപിപ്പിക്കുകയാണ്. കാമ്പസ് വിംഗിന്റെ ആശയവിനിമയ സംവിധാനങ്ങള്‍ ഏറെ ശ്രദ്ധേയമായി വരികയാണ്. സംസ്ഥാനത്ത് ഏറെ ശ്രദ്ധേയമായ കമ്മ്യൂണിറ്റി സെറ്റ് കാമ്പസ് വിംഗിന്റേതായി മാറിക്കഴിഞ്ഞു. അറബി കോളേജ്, ദര്‍സ് വിദ്യാര്‍ത്ഥികള്‍ക്കുള്ള ത്വലബാ വിംഗും സംഘടനയുടെ കരുത്തിന്റെ പ്രതീകമായ വിഖായയും പ്രവര്‍ത്തന രംഗത്ത് കര്‍മ്മ പദ്ധതികള്‍ സമര്‍പ്പിച്ച് സജീവ ശ്രദ്ധ നേടി വരുന്നു.
സര്‍ഗവാസനയെ പ്രോത്സാഹിപ്പിച്ച് യൂണിറ്റ് മുതല്‍ സംസ്ഥാന തലം വരെ സര്‍ഗപ്രതിഭകളെ വളര്‍ത്തിയെടുക്കുന്നതിന് ഉപകരിക്കുംവിധം നടത്തുന്ന ശ്രദ്ധേയമായ പ്രവര്‍ത്തനമാണ് സര്‍ഗലയം. ഓരോ രണ്ടു വര്‍ഷവും കൂടി നടക്കുന്ന സര്‍ഗലയം പ്രതിഭകളുടെ സംഗമമായി മാറുന്നു. പ്രതിഭകള്‍ക്കായി വിപുല സംവിധനാനത്തോടെ ഒരു സാസ്‌കാരിക സമിതി സംഘടനയുടെ ആലോചനയിലുണ്ട്.
മതതീവ്രവാദം കേരള മുസ്‌ലിം യൗവ്വനത്തെ കാര്‍ന്ന് തിന്നാല്‍ തുടങ്ങിയ ഘട്ടത്തില്‍ മതതീവ്രവാദത്തിനും വര്‍ഗ്ഗീയതക്കുമെതിരെ സംഘടന നടത്തിയ പോരാട്ടങ്ങള്‍ പൊതു സമൂഹത്തിന്റെ ശ്രദ്ധയും അംഗീകാരവുമ നേടിയതിന്റെ സാക്ഷിപത്രമാണ് ഓരോ റിപ്പബ്ലിക് ഡേയിലും നടക്കുന്ന മനുഷ്യജാലിക സംഗമങ്ങളുടെ അത്ഭുത പൂര്‍വ്വ വിജയം. നാടിന്റെ സൗഹൃദം കാക്കാന്‍ വികാരത്തിനെതിരെ വിചിന്തനത്തിന്റെയും കാര്യബോധത്തിന്റെയും കൂട്ടായ്മയായി മനുഷ്യജാലിക അടയാളപ്പെടുത്തിക്കഴിഞ്ഞു.
ഗതകാല സുകൃതം പേറി പുരോയാനത്തിന്റെ പുതുപ്പാട്ടുമായി മുന്നേറ്റത്തിന് കളമൊരുക്കാന്‍ റെയില്‍വേ ലിങ്ക് റോട്ടില്‍, കോഴിക്കോട് നഗര പ്രാന്തത്തില്‍ തലയുയര്‍ത്തി നില്‍ക്കുന്ന ഇസ്‌ലാമിക് സെന്റര്‍ മറ്റേതൊരു വിദ്യാര്‍ത്ഥി പ്രസ്ഥാനത്തിനും അവകാശപ്പെടാനാവാത്ത ആസ്ഥാനഗാംഭീര്യമാണ്.
രണ്ടരപതിറ്റാണ്ടുകടന്ന് പുതിയ പദ്ധതികള്‍, പുതിയ സ്വപ്നങ്ങള്‍, കര്‍മത്തിന്റെ നൈര്യന്തരമായി സംഘടന പ്രയാണം തുടരുന്നു. സമസ്തയുടെ തണലില്‍ നവോത്ഥാനത്തിന്റെ തുടിപ്പുള്ള ജൈത്രയാത്ര.</p>
</div>
</div>
</div>
</div>

    )
}

export default about
